[
    {"id":1,"name":"Teacher Gentle","video":0,"score":0,"sex":2,"url":"Teacher_Female_1","isShowInMian":0,"des":""},
    {"id":2,"name":"Teacher Melody","video":2,"score":0,"sex":2,"url":"Teacher_Female_2","isShowInMian":1,"des":" Oh, this clothes, don’t mention it! Teacher Bean wants me to wear the same clothes with him, who knows the reason."},
    {"id":3,"name":"Teacher Savage","video":1,"score":0,"sex":2,"url":"Teacher_Female_3","isShowInMian":1,"des":" My name is savage, but in fact I am very gentle, remember once a door fell down, I hold the door with one hand, hold the students with another hand, I am very gentle, right?"},
    {"id":4,"name":"Teacher Fairy","video":2,"score":0,"sex":2,"url":"Teacher_Female_4","isShowInMian":1,"des":"I'm an art teacher, look at this dress, it's my design, the students' drawing ability can certainly be improved with me"},
    {"id":5,"name":"Teacher Carl","video":2,"score":0,"sex":2,"url":"Teacher_Female_5","isShowInMian":1,"des":"No, I don't know that Mario, he just walked past me, and I was shocked too.\nI need to pay attention to the choice of clothing, I don’t want to wear the same clothing with others."},
    {"id":6,"name":"Teacher Maruko","video":3,"score":0,"sex":2,"url":"Teacher_Female_6","isShowInMian":1,"des":"I am teacher Maruko, and I like to play naughty with my classmates!\nDon't give them so much homework, the children should just have fun~"},
    {"id":7,"name":"Teacher Peter","video":3,"score":0,"sex":2,"url":"Teacher_Female_7","isShowInMian":1,"des":"Don't make me angry or I’ll summon Pikachu to punish you with a hundred thousand volts!\nJust kidding, I like this kind of humorous teaching style ~"},
    {"id":8,"name":"Teacher Cool","video":0,"score":0,"sex":1,"url":"Teacher_Male_1","isShowInMian":0,"des":""},
    {"id":9,"name":"Teacher Bean","video":1,"score":0,"sex":1,"url":"Teacher_Male_2","isShowInMian":1,"des":"Why I wear a helmet? Well... Because last time I was walking and looking at my phone, I bumped into a tree, so I won’t get hurt if I wear a helmet."},
    {"id":10,"name":"Teacher Strong","video":2,"score":0,"sex":1,"url":"Teacher_Male_3","isShowInMian":1,"des":"Last time I participated in a bullfight and I won first place, this is the first prize, look!\nIs there such a competition in our school?"},
    {"id":11,"name":"Teacher Beard","video":2,"score":0,"sex":1,"url":"Teacher_Male_4","isShowInMian":1,"des":"What is art? Art is explo... Emm, art is to present the picture that is in your mind on the drawing board\nWell done! (Luckily, I didn't say that mantra)"},
    {"id":12,"name":"Teacher Popeye","video":3,"score":0,"sex":1,"url":"Teacher_Male_5","isShowInMian":1,"des":"You say I look like Mario? Yes! A lot of people say that, and I'm used to it.\nThey say I was born like Popeye, so they named me  Popeye."},
    {"id":13,"name":"Teacher Lucky","video":3,"score":0,"sex":1,"url":"Teacher_Male_6","isShowInMian":1,"des":"See the red costume I'm wearing? I'm the Lucky who brings good luck to the school!\nEvery thing will be good!"},
    {"id":14,"name":"Teacher Strict","video":0,"score":5000,"sex":2,"url":"Teacher_Female_8","isShowInMian":1,"des":"As long as I'm in the classroom, students do not dare to desert and cheat in class. Shh… That’s because my class students are running away~"},
    {"id":15,"name":"Teacher Bald","video":0,"score":5000,"sex":1,"url":"Teacher_Male_7","isShowInMian":1,"des":"I had a fight with the bald principal in another school, and he pulled out my hair that cost me a lot of money to transplant."},
    {"id":16,"name":"Teacher Quiet","video":2,"score":0,"sex":2,"url":"Teacher_Female_9","isShowInMian":1,"des":"The bald principal of another school thinks I'm too long-winded, and every time I teach, my classmates tell me: Be quiet, teacher!"},
    {"id":17,"name":"Teacher Glasses","video":2,"score":0,"sex":1,"url":"Teacher_Male_8","isShowInMian":1,"des":"I'm a good teacher, my students love my classes, and I have many ways to fix those naughty students!"}
    ]